note-data-structure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-27 Sat 17:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>data structure</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">data structure</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org20f26fd">严蔚敏数据结构Video</a>
<ul>
<li><a href="#orgbe06bfe">绪论</a></li>
<li><a href="#orgda4ca63">线性表</a></li>
</ul>
</li>
<li><a href="#org4d0af92">数据结构与算法分析(Java语言描述)</a>
<ul>
<li><a href="#orgab3c0ac">1.引论</a></li>
<li><a href="#orgfff7220">2.算法分析</a></li>
<li><a href="#org6c8be4c">3.表、栈和队列</a></li>
<li><a href="#org2a091dc">4.树</a></li>
</ul>
</li>
<li><a href="#org9f8a610">Introduction to Algorithms</a>
<ul>
<li><a href="#org664807b">基础知识</a>
<ul>
<li><a href="#org7c049a0">算法基础</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf5a8189">Leetcode</a>
<ul>
<li><a href="#orgcb32bfb">LeetCode 3 &#x2014; Longest Substring Without Repeating Characters</a></li>
<li><a href="#org0f14de9">LeetCode 4 &#x2014; Median of Two Sorted Arrays</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org20f26fd" class="outline-2">
<h2 id="org20f26fd">严蔚敏数据结构Video</h2>
<div class="outline-text-2" id="text-org20f26fd">
</div>
<div id="outline-container-orgbe06bfe" class="outline-3">
<h3 id="orgbe06bfe">绪论</h3>
<div class="outline-text-3" id="text-orgbe06bfe">
<ol class="org-ol">
<li><p>
数据结构范畴 
</p>

<p>
算法 + 数据结构 = 程序设计
</p>

<p>
算法: 对问题怎么处理
</p>

<p>
数据结构：对条件规则,处理结果怎么输入输出
</p></li>

<li>基本概念

<ul class="org-ul">
<li><p>
数据
</p>

<p>
能被计算机处理的，能被计算机操作的对象，随着计算机的发展逐渐扩大，数字，图像，视频，多媒体信息
</p></li>

<li><p>
数据元素
</p>

<p>
数据项是数据结构中讨论的最小单位
</p>

<p>
数据元素是数据项的集合
</p></li>

<li><p>
数据结构
</p>

<p>
带结构的数据元素的集合
</p>

<p>
结构: 数据元素之间的关系
</p>

<p>
数据的逻辑结构可归结为4类: 线性结构、树形结构、图状结构、集合结构
</p>

<p>
数据结构的形式定义: 是一个二元组 Data-Structures = (D,S) D是数据元素上的有限集,S是D上的关系
</p>

<p>
数据的存储结构: 逻辑结构在计算机中的表示，逻辑结构在存储器中的映象
</p>

<p>
逻辑结构表现：数据元素的集合 + 关系的集合
</p>

<blockquote>
<p>
数据元素的映象方法：计算机中表示数据的最小元素是二进制位(bit) 
</p>

<p>
关系的映象方法: 
</p>
<ul class="org-ul">
<li>顺序映象 :以存储位置的相邻表示后继关系 y的存储位置和x的存储位置相差一个常量C</li>
<li>链式映象 :以附加信息(指针)表示后继关系</li>
</ul>
</blockquote></li>

<li><p>
数据类型
</p>

<p>
高级语言中每个变量常量表达式明确数据类型
</p>

<p>
数据类型是值的集合和定义在此集合上的一组操作的总称
</p></li>
<li><p>
抽象数据类型(Abstract Data Type ADT) 
</p>

<p>
是指一个数学模型以及定义在此数学模型上的一组操作
</p>

<p>
ADT两个特征:
</p>

<blockquote>
<ol class="org-ol">
<li><p>
数据抽象
</p>

<p>
用ADT描述程序处理的实体时,强调的是其本质的特征，其所能完成的功能以及和外部用户的接口
</p>

<p>
复数不能直接加减
</p>

<p>
初始化、取复数虚部、相加等方法
</p></li>
<li><p>
数据封装
</p>

<p>
外部用户不关心方法如何实现的
</p></li>
</ol>
</blockquote>

<p>
ADT的表示和实现：借用固有数据类型来表示和实现
</p></li>
</ul></li>
</ol>


<ol class="org-ol">
<li><p>
算法和算法的衡量
</p>

<p>
一个有限常的操作序列
</p>

<p>
算法的五个重要特性
有穷性、确定性、可行性、有输入、有输出
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgda4ca63" class="outline-3">
<h3 id="orgda4ca63">线性表</h3>
<div class="outline-text-3" id="text-orgda4ca63">
<p>
线性结构 是一个数据元素的有序(次序)集
</p>

<p>
基本特征：
</p>
<blockquote>
<ol class="org-ol">
<li>唯一一个 第一元素</li>
<li>唯一的 最后元素</li>
<li>唯一的后继</li>
<li>唯一的前继</li>
</ol>
</blockquote>

<ul class="org-ul">
<li>线性表的类型定义
<ol class="org-ol">
<li>抽象数据类型线性表的定义
数据对象、
数据关系</li>
</ol></li>
<li>线性表类型的实现-顺序映象</li>
<li>线性表类型的实现-链式映象</li>
<li>一元多项式的表示</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4d0af92" class="outline-2">
<h2 id="org4d0af92">数据结构与算法分析(Java语言描述)</h2>
<div class="outline-text-2" id="text-org4d0af92">
</div>
<div id="outline-container-orgab3c0ac" class="outline-3">
<h3 id="orgab3c0ac">1.引论</h3>
<div class="outline-text-3" id="text-orgab3c0ac">
<p>
数学、递归、java等基础
如果除去对象的基本类型外,实现方法是相同的，那么我们可以用泛型实现来描述这种基本功能.
泛型、自动装箱/拆箱
泛型static方法 
类型限界 type bound
</p>
</div>
</div>

<div id="outline-container-orgfff7220" class="outline-3">
<h3 id="orgfff7220">2.算法分析</h3>
<div class="outline-text-3" id="text-orgfff7220">
<p>
数据读入是一个瓶颈
</p>

<p>
计算运行时间，大O是一个上届，程序可能提前结束，但决不能错后
</p>

<ul class="org-ul">
<li><p>
一般法则:
</p>

<p>
分析的基本策略是从内部向外展开工作的
</p>

<ul class="org-ul">
<li><p>
法则1 for循环
</p>

<p>
一个for循环的运行时间至多是该for循环内部那些语句的运行时间*迭代次数
</p></li>

<li><p>
法则2 嵌套的for循环
</p>

<p>
从里向外分析这些循环。在一组嵌套循环内部的一条语句总的运行时间
</p>

<p>
为该语句的运行时间乘以该组所有的for循环的大小乘积
</p>

<p>
O(N^2)
</p></li>

<li><p>
法则3 顺序语句
</p>

<p>
将各个语句的运行时间求和即可，意味着最大值就是所得的运行时间
</p></li>

<li><p>
法则4 if/else语句
</p>

<p>
if + else
</p></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6c8be4c" class="outline-3">
<h3 id="org6c8be4c">3.表、栈和队列</h3>
<div class="outline-text-3" id="text-org6c8be4c">
<p>
最简单和最基本的三种数据结构
</p>

<p>
实际上，每个有意义的程序都将显式的至少使用一种这样的数据结构，
</p>

<p>
栈在程序中总是被间接的用到，不管程序是否做了声明
</p>

<p>
ADT 抽象数据类型 是带有一组操作的一些对象的集合
</p>

<ul class="org-ul">
<li>表ADT list
<ol class="org-ol">
<li><p>
简单数组实现
</p>

<p>
array
</p>

<p>
数组是由固定容量创建的，使用数组的时候需要对表的大小进行评估
</p>

<p>
如果对表做插入和删除操作，特别是对表的前段进行操作，数组就不合适
</p>

<p>
最坏的O(N) 最好的O(1)
</p></li>
<li><p>
简单链表实现
</p>

<p>
linked list
</p>

<p>
为了避免插入和删除的线性开销，需要保证表可以不连续存储
</p>

<p>
链表由一系列节点组成，这些节点不必在内存中相连。
</p>

<p>
每个节点均含有表元素和到后继元素的link链，叫做next链
</p>

<p>
最后一个节点的next链引用null
</p>

<p>
在经典链表中，每个节点只存储到其下一个节点的链，
</p>

<p>
存在指向前驱节点的链，我们称之为双链表
</p>

<p>
LIST接口: 1.ArrayList 2.LinkedList
</p></li>

<li>list adt 两种流行的实现方式

<ol class="org-ol">
<li><p>
ArrayList
</p>

<p>
一种可增长数组的实现，
优点：对get/set方法调用花费常数时间
缺点: 插入/删除 代价昂贵    
</p></li>
<li><p>
Linkedlist
</p>

<p>
双链表的实现
</p>

<p>
优点：插入/删除 开销很小
缺点：get的索引操作 不容易 采用迭代器的方式更高效的取数据 
</p></li>
</ol></li>
</ol></li>
<li><p>
栈ADT stack
</p>

<p>
栈stack是限制插入和删除只能在一个位置的表，该位置是表的末端，叫做栈的顶端（top）
</p>

<p>
栈有时又叫做LIFO表（后进先出）
</p>

<p>
push 进栈
</p>

<p>
pop  出栈
</p></li>
<li><p>
队列ADT queue
</p>

<p>
和栈一样队列也是表，使用队列时，插入在一端进行，删除则在另一端进行。
</p>

<p>
队又叫做FIFO表（先进先出）
</p>

<p>
enqueue：入队  在表的末端(rear)插入元素
</p>

<p>
dequeue：出队  删除在表开头(front)的元素
</p></li>
</ul>
</div>
</div>







<div id="outline-container-org2a091dc" class="outline-3">
<h3 id="org2a091dc">4.树</h3>
<div class="outline-text-3" id="text-org2a091dc">
<p>
根的深度为0，树叶的高度为0
</p>

<ul class="org-ul">
<li>树的遍历: 
<ol class="org-ol">
<li>先序遍历</li>
<li>后序遍历</li>
<li>中序遍历</li>
</ol></li>

<li><p>
二叉树
binary tree 是一棵树，其中每个节点都不能有多于两个的儿子
</p>

<p>
性质：一棵平均二叉树的深度要比节点个数N小的多
</p>

<p>
树节点的声明类似双链表，节点包含element，和leftkk、right引用
</p>

<p>
二叉查找树: 对于树中的每个节点X,它的左子树中所有项的值小于X中的项，而它的右子树中所有项的值大于X中的项
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9f8a610" class="outline-2">
<h2 id="org9f8a610">Introduction to Algorithms</h2>
<div class="outline-text-2" id="text-org9f8a610">
</div>
<div id="outline-container-org664807b" class="outline-3">
<h3 id="org664807b">基础知识</h3>
<div class="outline-text-3" id="text-org664807b">
<p>
计算时间是一种有限的资源，存储器中的空间也是一样的,时间或空间方面有效的算法使你能够明智地使用这些资源
</p>
</div>
<div id="outline-container-org7c049a0" class="outline-4">
<h4 id="org7c049a0">算法基础</h4>
</div>
</div>
</div>
<div id="outline-container-orgf5a8189" class="outline-2">
<h2 id="orgf5a8189">Leetcode</h2>
<div class="outline-text-2" id="text-orgf5a8189">
</div>
<div id="outline-container-orgcb32bfb" class="outline-3">
<h3 id="orgcb32bfb">LeetCode 3 &#x2014; Longest Substring Without Repeating Characters</h3>
</div>
<div id="outline-container-org0f14de9" class="outline-3">
<h3 id="org0f14de9">LeetCode 4 &#x2014; Median of Two Sorted Arrays</h3>
<div class="outline-text-3" id="text-org0f14de9">
<p>
logn 堆排序 归并排序 快速排序
</p>

<p>
n 桶排序</p>
</div>
</div>
</div>
</div>
</body>
</html>